---
revision_date: "2021-09-15"
template: single.html
---

# 资料品质 { #data-quality }

本章讨论与数据质量有关的各个方面。

## 测量数据质量 { #measuring-data-quality }

资料齐全吗？是否按时收集？这是对的吗？这些是分析数据时需要问的问题。糟糕的数据质量可能有多种形式；不仅仅是不正确的数字，而是缺乏完整性，或者数据太旧（无法有意义地使用）。

## 数据质量差的原因 { #reasons-for-poor-data-quality }

数据质量差的潜在原因有很多，其中包括：

- 收取的金额过多；需要收集的数据过多会导致时间减少，完成报告的“捷径”

- 许多手动步骤；在不同纸张形式之间移动数字、总结等

- 定义不明确；对要填写的字段的错误解释

- 缺乏信息使用：没有动力去提高质量

- 信息系统的碎片化；可能导致重复报告

## 改善数据质量 { #improving-data-quality }

提高数据质量是一项长期任务，许多措施本质上是组织性的。但是，从任何实施过程开始，数据质量就应该是一个问题，并且有些事情可以立即解决，例如 DHIS2 中的检查。一些重要的数据质量改进措施是：

- 更改数据收集表格，统一表格

- 在收集数据的地方一级促进信息使用

- 制定检查数据质量的例程

- 将数据质量纳入培训

- 在DHIS2中实施数据质量检查

## 使用DHIS2改善数据质量 { #using-dhis2-to-improve-data-quality }

DHIS2 有几个功能可以帮助提高数据质量的工作；数据输入期间的验证，以确保以正确的格式和合理的范围捕获数据，用户定义的验证规则基于所捕获数据之间的数学关系（例如小计与总计），异常值分析函数，以及关于数据覆盖率和完整性。更间接地说，DHIS2 的一些设计原则有助于提高数据质量，例如将数据协调到一个集成数据仓库中的想法，支持本地级别访问数据和分析工具，以及通过提供广泛的数据分析工具和传播。随着更加结构化和统一的数据收集流程以及在各个层面加强信息使用，数据的质量将会提高。以下是更直接针对数据质量的功能概述：

### 数据输入验证 { #data-input-validation }

DHIS2 中最基本的数据质量检查类型是确保捕获的数据格式正确。 DHIS2 将向用户提示输入的值格式不正确，并且在将其更改为可接受的值之前不会保存该值。例如。不能在数字字段中输入文本。 DHIS2 支持的不同类型的数据值在用户手册的数据元素章节中进行了解释。

### 最小和最大范围 { #min-and-max-ranges }

为了在数据输入期间停止输入错误（例如输入“1000”而不是“100”），DHIS2 检查输入的值是否在合理范围内。该范围基于同一医疗机构先前为同一数据元素收集的数据，并由最小值和最大值组成。只要用户在外部输入一个值，就会提醒用户该值不被接受。为了计算合理范围，系统需要至少六个月（期）的数据。

### 验证规则 { #validation-rules }

验证规则基于定义多个数据元素之间关系的表达式。该表达式具有左侧和右侧以及定义前者是否必须小于、等于或大于后者的运算符。该表达式形成一个条件，该条件应断言满足某些逻辑标准。例如，验证规则可以断言给予婴儿的疫苗总数小于或等于婴儿总数。左右两边必须返回数值。

验证规则可以通过用户界面定义，然后运行以检查现有数据。运行验证规则时，用户可以指定要检查数据的组织单位和期间，因为对所有现有数据运行检查将花费很长时间并且可能也不相关。检查完成后，将向用户呈现一份报告，其中包含验证违规情况，说明需要更正哪些数据值。

验证规则检查也内置在数据输入过程中，因此当用户完成表单时，可以运行规则以仅在关闭表单之前检查该表单中的数据。

### 离群分析 { #outlier-analysis }

基于标准偏差的异常值分析提供了一种机制，用于揭示在数值上与其余数据相距甚远的值。异常值可能是偶然发生的，但它们通常表示测量错误或重尾分布（导致非常高的数字）。在前一种情况下，人们希望丢弃它们，而在后一种情况下，在使用假设正态分布的工具或解释时应谨慎。分析基于标准正态分布。

### 完整性和及时性报告 { #completeness-and-timeliness-reports }

完整性报告将显示组织单位和期间提交了多少数据集（表格）。您可以使用三种不同方法之一来计算完整性； 1) 基于数据输入中的完整性按钮，2) 基于一组定义的强制性数据元素，或 3) 基于数据集的总注册数据值。

完整性报告还将显示
区域按时报告，及时报告的百分比
给定区域中的设施。及时性计算基于
系统设置称为期末后的天数，以符合及时数据的条件
提交。

# 组织单位 { #organisation-units }

在 DHIS2 中，数据的位置，即地理环境，被表示为组织单位。组织单位可以是卫生机构或提供服务的部门/子单位，也可以是代表地理区域（例如卫生区）的行政单位。

组织单元位于层次结构中，也称为树。层次结构将反映卫生行政结构及其级别。这种层次结构中的典型级别是国家、省、地区和设施级别。在 DHIS2 中，有一个单一的组织层次结构，因此定义和映射到现实的方式需要仔细考虑。主要组织层次结构中定义的地理区域和级别将对应用程序的可用性和性能产生重大影响。此外，还有一些方法可以解决替代层次结构和级别，如进一步称为“组织单位组和组集”的部分所述。

## 组织单位层次结构设计 { #organisation-unit-hierarchy-design }

设计合理的组织单元层次结构的过程有很多方面：

- _包括所有报告卫生设施：_所有有助于国家数据收集的卫生设施都应包括在系统中。应纳入各种所有制的设施，包括私人、公共、非政府组织和以信仰为导向的设施。通常，私人设施占一个国家设施总数的一半，并且对它们实施了数据报告政策，这意味着需要整合来自此类设施的数据才能获得现实的国家汇总数据。

- _强调卫生行政层级：_ 一个国家通常有多个行政层级，这些层级往往没有得到很好的协调和协调。在考虑设计 DHIS2 数据库时要强调的内容时，应牢记哪些领域最有趣，并且最常被要求进行数据分析。 DHIS2主要是管理健康数据，并基于健康管理结构进行分析。这意味着即使可能进行调整以迎合金融和地方政府等领域，DHIS2 组织单位层次结构的出发点应该是卫生行政领域。

<!-- end list -->

- _限制组织单元层次结构级别的数量：_ 为了满足来自地方政府和财政部等各种组织机构的分析要求，将所有这些领域作为组织单元包含在 DHIS2 数据库中是很诱人的。但是，出于性能考虑，应该尝试将组织单位层次结构级别限制为尽可能少的数量。层次结构用作任何报告工具中要呈现的数据聚合的基础，因此在为更高级别生成聚合数据时，DHIS2 应用程序必须搜索并添加为位于更下方的所有组织单位注册的数据等级制度。因此，增加组织单元的数量将对应用程序的性能产生负面影响，并且数量过多可能会成为这方面的重大问题。

  此外，DHIS2 中大多数分析工具的核心部分是基于动态选择要包含的“父”组织单元。例如，人们想选择一个省并将属于该省的地区包括在报告中。如果从分析的角度来看，地区级别是最有趣的级别，并且在该级别和省级别之间存在多个层次结构级别，则此类报告将无法使用。在构建层次结构时，应该关注报告和数据分析中经常使用的级别，而忽略很少或从不使用的级别，因为这会对应用程序的性能和可用性产生影响。

- _避免一对一的关系：_设计层次结构的另一个指导原则是避免连接具有接近一对一父子比率的级别，这意味着例如一个地区（父级）应该平均超过一个在将地方议会级别添加到层次结构之前，以下级别的地方议会（子）是有意义的。 1:4 或更高的亲子比例对于数据分析目的更有用，因为人们可以开始查看例如一个地区的数据如何分布在不同的子区域中，以及这些区域的差异。当以下级别具有与父母相同的目标人群和相同的服务卫生设施时，此类深入练习不是很有用。

  在将现实映射到 DHIS2 组织单位层次结构时跳过地理级别可能很困难，并且很容易导致某些利益相关者之间的阻力，但应该记住，实际上存在基于地理级别生成报告的方法，这些方法不属于DHIS2 中的组织层次结构，将在下一节中解释。

## 组织单位组和组集 { #organisation-unit-groups-and-group-sets }

在DHIS2中，可以将组织单元分组到组织单元组中，这些组可以进一步组织成组集。它们一起可以模仿可在创建报告和其他数据输出时使用的替代组织层次结构。除了代表不属于主要层次结构的替代地理位置之外，这些组对于为卫生设施分配分类方案很有用，例如。根据设施的类型或所有权。可以通过用户界面在应用程序中定义任意数量的组集和组，所有这些都是在本地为每个 DHIS2 数据库定义的。

一个例子最好地说明了这一点：通常，人们希望根据设施的所有权提供分析。在这种情况下，可以为每种所有权类型创建一个组，例如“MoH”、“Private”和“NGO”。然后必须将数据库中的所有设施分类并分配给这三个组中的一个且仅一个。接下来将创建一个名为“Ownership”的组集，将上述三个组分配到该组，如下图所示。

![](resources/images/organisation_unit_hiearchy.png)

以类似的方式，可以为其他管理级别创建组集，例如地方议会。所有地方议会都必须定义为组织单元组，然后分配给一个名为“地方议会”的组集。最后一步是将所有卫生设施分配给一个也是唯一一个地方议会团体。这使 DHIS2 能够生成每个地方议会的汇总报告（将所有分配的卫生设施的数据加在一起），而不必将地方议会级别包括在主要的组织层次结构中。对于需要的任何其他行政或地理级别，都可以采用相同的方法，每个额外级别设置一个组。在 DHIS2 中继续进行设计之前，需要在附加地理级别的区域与每个区域的卫生设施之间进行映射。

DHIS2 中要理解的组集概念的一个关键属性是_exclusivity_，这意味着一个组织单元可以是组集中的一个组的成员。在按不同组汇总卫生设施数据时，违反此规则将导致数据重复，因为分配给同一组集中两个组的设施将被计算两次。

有了这种结构，DHIS2可以为每个
组织单位所有权类型中的“
“报告”模块中或通过Excel数据透视表访问“组设置报告”
第三方工具。例如，可以查看和比较利用率
不同所有权类型（例如，卫生部，私人，
非政府组织）。此外，DHIS2可以提供
“报告”中“组织单位分配报告”中的设施
模块。例如，可以查看在任何情况下存在多少设施
各个层次结构中给定的组织单位
所有权类型。在GIS模块中，鉴于该医疗机构
坐标已在系统中注册，可以查看
不同类型的医疗机构的位置（不同
每种类型的符号），并将此信息与另一个
显示指标的地图图层，例如按地区。

# 数据元素和自定义维度 { #data-elements-and-custom-dimensions }

本章首先讨论系统的一个重要组成部分：数据元素。其次，它讨论了类别模型以及如何使用它来实现高度定制的元数据结构来存储数据。

## 资料元素 { #data-elements }

数据元素与组织单元一起是 DHIS2 数据库最重要的组成部分。它代表_what_维度并解释正在收集或分析的内容。在某些情况下，这被称为指标，但在 DHIS2 中，数据收集和分析的元数据元素被称为数据元素。数据元素通常表示某个事件的计数，其名称描述了正在计数的内容，例如“给予的 BCG 剂量”或“疟疾病例”。当数据被收集、验证、分析或呈现时，它是由描述数据注册的现象、事件或案例的数据元素构建的数据元素或表达式。因此，数据元素对于系统的各个方面都变得很重要，不仅决定了如何收集数据，更重要的是决定了数据在数据库中的表示方式以及数据的分析和呈现方式。

设计数据元素背后的一个重要原则是将数据元素视为对现象或事件的自包含描述，而不是数据输入表单中的字段。每个数据元素都独立存在于数据库中，完全独立于集合形式。重要的是要考虑到数据元素直接用于报告、图表和其他数据分析工具中，其中任何给定数据输入表单中的上下文既不可访问也不相关。换句话说，必须能够通过仅查看其名称来清楚地识别数据元素代表什么事件。基于此，可以得出一条经验法则，即数据元素的名称必须能够独立存在，并且也在其集合形式的上下文之外描述数据值。

例如，当在捕获免疫数据的数据输入表格、捕获疫苗接种库存的表格以及门诊数据的表格中看到称为“疟疾”的数据元素时，可能会很简洁。但是，在报表中查看时，在数据输入表单的上下文之外，无法确定该数据元素代表什么事件。如果数据元素被称为“疟疾病例”、“收到的疟疾储备剂量”或“给予的疟疾剂量”，那么从用户的角度来看，报告试图表达的内容是很清楚的。在这种情况下，我们正在处理三个具有完全不同语义的不同数据元素。

## 类别和自定义维度 { #categories-and-custom-dimensions }

数据捕获的某些要求需要对描述正在计数的事件的维度进行细粒度分解。例如，有人想要收集按性别和年龄组细分的“疟疾病例”数量，例如“女性”、“男性”和“\< 5 years” and “\> 5 年”。其特点是，通常会针对许多“基础”数据元素重复分解：例如，希望将这种分解重复用于其他数据元素，例如“TB”和“HIV”。为了使元数据更具动态性、可重用性和适用于分析，将上述疾病定义为数据元素并为分解属性创建单独的模型是有意义的。这可以通过使用下面描述的类别模型来实现。

类别模型具有三个主要元素，最好使用上面的示例进行描述：

1.  类别选项，分别对应“女”、“男”和“\< 5 years” and “\> 5年”。

2.  类别，对应于“性别”和“年龄组”。

3.  类别组合，在上面的例子中应该被命名为“性别和年龄组”，并分配给上面提到的两个类别。

这个类别模型实际上是独立的，但在 DHIS2 中与数据元素松散耦合。松耦合在这方面意味着数据元素和类别组合之间存在关联，但是这种关联可以随时更改而不会丢失任何数据。但是，不建议经常更改此设置，因为它通常会降低数据库的价值，因为它会降低数据的连续性。请注意，对于类别中的类别选项数量或类别组合中的类别数量没有硬性限制，但是对于结构变得混乱和笨拙的地方存在自然限制。

现在可以使用一对数据元素和类别组合来表示任何级别的细分。重要的是要了解实际发生的情况是为数据分配了许多自定义维度。就像数据元素代表数据值的强制维度一样，类别向其添加自定义维度。在上面的示例中，我们现在可以通过 DHIS2 输出工具对这些数据元素进行基于“性别”和“年龄组”的分析，就像基于数据元素、组织单位和时期进行分析一样.

此类别模型既可用于数据输入表单设计，也可用于分析和表格报告。出于分析目的，DHIS2 将自动为与类别组合关联的每个数据元素生成小计和总计。此计算的规则是所有类别选项的总和应为有意义的总数。上面的示例显示了如此有意义的总数，因为当汇总“女性 \ < 5 years”, “male \< 5 years”, “female \> 5 年”和“男性 \> 5 年”捕获的“疟疾病例”时，将得到“疟疾病例”的总数。

出于数据采集的目的，DHIS2 可以自动生成表格数据输入表单，其中数据元素表示为行，类别选项组合表示为列。在许多情况下，这会以最小的努力导致引人注目的形式。需要注意的是，这代表了一个两难境地，因为这两个问题有时是不兼容的。例如，您可能希望通过使用不符合有意义总计规则的类别来快速创建数据输入表单。然而，我们确实认为这比为数据输入和数据分析维护两个独立且独立的模型更好。

关于类别模型的一个重要点是数据值被持久化并与类别选项组合相关联。这意味着从类别组合中添加或删除类别会使这些组合无效，并且必须执行低级数据库操作来纠正它。因此，建议仔细考虑需要哪些故障，并且不要过于频繁地更改它们。

## 数据元素组 { #data-element-groups }

数据元素的通用属性可以通过什么来建模
称为数据元素组。这些小组在
感觉他们的名字和成员资格都是由
用户。组对于浏览和显示相关数据非常有用，
并且还可以用于汇总为以下数据元素捕获的值
群组。组松散地耦合到数据元素，而不是束缚
直接指向数据值，这意味着可以对其进行修改和添加
在任何时间点都不会干扰底层数据。

# 数据集和表格 { #data-sets-and-forms }

本章讨论了数据集和表格、可用的表格类型，并描述了从纸质表格到电子表格的过程中的最佳实践。

## 什么是数据集？ { #what-is-a-data-set }

DHIS2中的所有数据输入都是通过使用数据集来组织的。一种
数据集是为数据分组在一起的数据元素的集合
集合，并且在分布式安装的情况下，它们还定义了
DHIS2实例之间用于导出和导入的大块数据（例如
从地区办公室本地安装到国家服务器）。数据
集不直接链接到数据值，仅通过它们的数据
元素和频率，因此可以修改数据集，
随时删除或添加而不影响原始数据
已经被系统捕获了，但是这样的改变当然会影响
如何收集新数据。

数据集具有控制数据收集频率的周期类型，可以是每天、每周、每月、每季度、每六个月或每年。要包含在数据集中的数据元素和周期类型都由用户定义，以及名称、简称和代码。如果收集表单中需要计算字段（不仅在报告中），那么指标也可以分配给数据集，但这些只能在自定义表单中使用（见下文）。

为了使用数据集来收集特定组织单位的数据，用户必须将组织单位分配给数据集。该机制控制了哪些组织单位可以使用哪些数据集，同时定义了数据完整性的目标值（例如，一个地区有多少卫生机构预计每月提交 RCH 数据集）。

一个数据元素可以属于多个数据集，但这需要仔细考虑，因为它可能会导致收集的数据重叠和不稳定，例如数据集被赋予不同的频率，并由相同的组织单位使用。

## 什么是数据输入表格？ { #what-is-a-data-entry-form }

将数据集分配给组织单位后，该数据集将在数据输入（在服务下）中为您分配给它的组织单位和根据数据集的期间类型的有效期间提供。然后将显示一个默认数据输入表单，它只是属于数据集的数据元素的列表以及用于输入值的列。如果您的数据集包含具有诸如年龄组或性别等类别的数据元素，则将根据类别以默认形式自动生成其他列。除了默认的基于列表的数据输入表单之外，还有另外两种选择，即基于部分的表单和自定义表单。

### 数据输入表格的类型 { #types-of-data-entry-forms }

DHIS2 目前具有三种不同类型的表格，如下所述。

#### 预设表格 { #default-forms }

默认数据输入表单只是属于数据集的数据元素的列表以及用于输入值的列。如果您的数据集包含具有非默认类别组合的数据元素，例如年龄组或性别，则将根据不同的选项/维度以默认形式自动生成其他列。如果您在数据集中使用多个类别组合，您将在默认表单中为每个类别组合获得一个表，选项具有不同的列标题。

#### 部分表格 { #section-forms }

在使用表格形式时，截面形式允许更多的灵活性，并且设计快速简单。通常您的数据输入表单将需要多个带有子标题的表格，有时您需要禁用（灰显）表格中的一些字段（例如，某些类别不适用于所有数据元素），这两个功能在部分表单中都支持.定义数据集后，您可以使用数据元素的子集、标题和部分表格中可能的灰色字段来定义它的部分。还可以定义数据集中部分的顺序。在数据输入中，您现在可以开始使用“部分”表单（当部分可用于所选数据集时，该表单应自动出现）。大多数表格数据输入表格应该可以与部分表格有关。使用部分或默认表单使生活变得轻松，因为无需维护包含对数据元素的引用的固定表单设计。如果这两种类型的表格不符合您的要求，那么第三种选择是完全灵活但更耗时的自定义数据输入表格。

#### 自订表格 { #custom-forms }

当您要设计的表单对于默认表单或部分表单而言过于复杂时，您最后的选择是使用自定义表单。这需要更多时间，但在设计方面为您提供了充分的灵活性。在 DHIS2 中，表单设计器中有一个内置的 HTML 编辑器（CK 编辑器），它允许您在 GUI 中设计表单或直接粘贴到您的 html 中（使用编辑器中的“源”窗口）。在自定义表单中，您可以插入静态文本或数据字段（链接到数据元素

- 类别选项组合）在表单上的任何位置，您可以完全自由地设计表单的布局。一旦将自定义表单添加到数据集中，它将在数据输入中可用并自动使用。

使用自定义表单时，可以使用计算字段来显示，例如根据表格中捕获的数据运行总计或其他计算。这可以例如在处理需要项目余额、下期所需项目等的库存或物流表单时很有用。为此，用户必须首先将计算的表达式定义为指标，然后将这些指标分配给相关数据集。在自定义表单设计器中，用户可以将指标分配给表单，就像分配数据元素一样。计算表达式的限制是表达式中使用的所有数据元素必须在同一数据集中可用，因为计算是在表单内动态完成的，而不是基于已经存储在数据库中的数据值。

## 从纸质到电子形式-经验教训 { #from-paper-to-electronic-form-lessons-learned }

在引入电子健康信息系统时，被替换的系统通常是基于纸质的报告。迁移到电子数据捕获和分析的过程存在一些挑战。以下部分建议了如何克服这些问题的最佳实践。

### 识别独立的数据元素 { #identify-self-contained-data-elements }

通常，DHIS2 数据集的设计基于已在使用的纸质表格的一些要求。纸质表格的逻辑与DHIS的数据元素和数据集模型不同，例如通常，表格纸形式中的字段由列标题和每行上的文本来描述，有时还使用一些提供更多上下文的介绍性表格标题。在数据库中，这是为一个原子数据元素捕获的，不参考可视表格式中的位置，因此确保具有可选数据元素类别的数据元素捕获每个单独字段的完整含义很重要。纸质表格。

### 将计算和重复留给计算机-仅捕获原始数据 { #leave-calculations-and-repetitions-to-the-computer-capture-raw-data-only }

设计数据集时要记住的另一重要事项是
该数据集和相应的数据输入形式（即数据
设置版式）是一种数据收集工具，而不是报告或分析
工具。还有其他更为复杂的工具可用于数据输出和
在DHIS2中进行报告，而不是在数据输入表中进行报告。纸质表格通常是
设计时要同时考虑数据收集和报告
您可能会看到诸如累积值之类的信息（除了
每月值），重复年度数据（相同的人口数据）
每月报告一次）甚至指标值，例如
与每月原始数据的格式相同。当您将原始数据存储在
每个月都有DHIS2数据库，并拥有您所有的处理能力
计算机工具中的需求，这是没有必要的（实际上是
错误，很可能导致不一致）手动注册
计算值，例如上述值。你只想
捕获数据集/表格中的原始数据并保留计算结果
到计算机，并将这些值呈现给报告工具
在DHIS中。通过数据集报告的功能，所有表格
表格将自动在最右边获得额外的列
提供每一行（数据元素）的小计和总计值。

# 指标 { #indicators }

本章涵盖以下主题：

- 什么是指标

- 指标目的

- 指标驱动的数据收集

- DHIS2中的指标管理

下面将更详细地描述这些主题。

## 什么是指标？ { #what-is-an-indicator }

在DHIS2中，指标是数据分析的核心要素。指标是基于数据元素、类别选项、可能的常数和因子的组合的计算公式。指标有两种形式，一种是有分母的，一种是没有分母的。可能由多个数据元素组成的计算总数没有分母。覆盖指标（比率、百分比等）由两个数据元素公式组成，一个代表分子，另一个代表分母。

因此，指标由数据元素和其他组件的公式组成，并且总是乘以一个因子（例如 1、100、100、100 000）。该因子本质上是一个数字，它乘以分子除以分母的结果。作为一个具体的例子，指标“BCG 覆盖率 <1 年”由一个公式定义，该公式具有系数 100（以获得百分比）、分子（“给予 1 岁以下儿童的 BCG 剂量”）和分母（ “1 岁以下的目标人群”）。指标“DPT1 至 DPT3 退出率”是 100 % x (“DPT1 给药剂量”-“DPT3 给药剂量”) / (“DPT1 给药剂量”) 的公式。

表：指标示例

| 指示符 | 公式 | 分子 | 分母 | 因素 |
| --- | --- | --- | --- | --- |
| 完全免疫 <1 年覆盖 | 完全免疫/人口 < 1 年 x 100 | 完全免疫 | 人口 < 1 | 100（百分比） |
| 产妇死亡率 | 孕产妇死亡/活产 x 100 000 | 孕产妇死亡 | 活产 | 100 000（每 100 000 人测量 MMR） |
| 累计参保人数 | 累计参保人数 x 1 | 累计参保人数（男，年龄<18）+累计参保人数（男，18岁+）+累计参保人数（女，年龄<18）+累计参保人数（女，18岁+） | 没有 | 1 |

## 指标目的 { #purpose-of-indicators }

用分子和分母定义的指标通常对分析更有用。因为它们是比例，所以它们在时间和空间上具有可比性，这一点非常重要，因为分析和比较的单位（例如地区）的大小会随着时间而变化。人口为 1000 人的地区可能比人口为 10,000 人的地区发生特定疾病的病例更少。但是，由于每个地区使用了各自的人口，因此两个地区之间给定疾病的发病率值将具有可比性。

因此，指标可以进行比较，并且是数据分析的主要工具。 DHIS2 应为所有健康计划的分析提供相关指标，而不仅仅是原始数据。 DHIS2 中的大多数报告模块都支持数据元素和指标，您也可以将它们组合到自定义报告中。

## 指标驱动的数据收集 { #indicator-driven-data-collection }

由于指标比数据元素更适合分析，因此指标的计算应该是数据收集的主要驱动力。通常的情况是收集了很多数据，但从未在任何指标中使用，这大大降低了数据的可用性。捕获的数据元素应该包含在用于管理的指标中，或者根本不应该收集它们。

出于实施目的，应在 DHIS2 中定义和实施用于管理的指标清单。对于分析，培训应侧重于指标的使用，以及为什么这些指标比数据元素更适合此目的。

## 管理指标 { #managing-indicators }

在 DHIS2 中可以随时添加、删除或修改指标，而不会影响数据。指标不是作为值存储在 DHIS2 中，而是作为公式存储，在用户需要时计算。因此，公式的更改只会导致在使用指标进行分析时调用不同的数据元素，而不会对基础数据值进行任何更改。有关如何管理指标的信息，请参阅 DHIS2 用户文档中的指标章节。
