---
edit_url: "https://github.com/dhis2/dhis2-docs/blob/master/src/commonmark/en/content/implementation/conceptual-design-principles.md"
---

# 概念设计原则

本章介绍了一些关键的概念
DHIS2软件背后的设计原则。理解与存在
了解这些原则将有助于实施者更好地利用
自定义本地数据库时的软件版本。虽然本章
介绍了原理，以下各章将详细介绍
这些都反映在数据库设计过程中。

以下概念设计原则将在本节中介绍
章节：

  - 可以通过用户界面添加和修改所有元数据

  - 灵活的数据模型支持将不同的数据源
    集成在一个单一的数据存储库中

  - 数据输入\！=数据输出

  - 指标驱动的数据分析和报告

  - 维护数据库中的分类设施数据

  - 支持卫生系统中任何级别的数据分析

在以下部分中，将更详细地描述每个原理。

## 可以通过用户界面添加和修改所有元数据

DHIS2应用程序附带了一组用于数据的通用工具
收集，验证，报告和分析，但其内容
数据库，例如收集什么数据，数据来自何处，等等
哪种格式，取决于使用环境。这些元数据需要
在可以使用之前被填充到应用程序中，并且可以
通过用户界面完成，无需编程。这允许
让了解了
该软件将支持的HIS的详细信息。

该软件将描述原始数据的关键元数据分开
被存储在数据库中，这是
不应随时间变化太多（以避免损坏数据），并且
更高级别的元指标指示符公式，验证规则和组
用于汇总以及收集表单的各种布局，以及
报告，这些报告并不重要，可以随时间更改
而不干扰原始数据。作为这种更高级别的元数据
可以随时间添加和修改，而不会干扰原始
数据，支持连续的自定义过程。通常是新的
随着当地实施团队的学习，功能会随着时间的推移而增加
掌握更多功能，而用户正在逐步推动更多功能
先进的数据分析和报告
输出。

## 灵活的数据模型支持将不同的数据源集成到单个数据存储库中

DHIS2设计遵循HIS的集成方法，并支持
将许多不同的数据源集成到一个数据库中，
有时称为集成数据存储库或数据
仓库。

DHIS2是一个骨架状的工具，没有预定义的形式或
报告意味着它可以支持很多不同的汇总数据
资料来源。真正没有限制健康使用的东西
虽然在其他行业中的使用仍然非常有限，但两者都可以。如
只要数据是由组织单位（组织单位）收集的，
描述为数据元素（可能经过一些分解）
类别），并且可以通过预定义的周期频率来表示
可以在DHIS2中收集和处理。这种灵活性使DHIS2 a
建立集成在一起的集成系统的强大工具
来自多个健康计划的收集工具，指标和报告，
部门或计划。定义数据后再收集
或导入到DHIS2数据库中，可以对其进行相关分析
同一数据库中的任何其他数据，无论其来源和方式如何
集。除了支持集成数据分析和
报告，这种集成方法还有助于合理化数据
收集并减少重复。

## 数据输入\！=数据输出

在 DHIS2 中，有三个维度来描述聚合数据
被收集并存储在数据库中；地点组织
单位、内容数据元素和时间段。组织机构
单位、数据元素和周期构成了三个核心维度：
需要描述 DHIS2 中的任何数据值，无论它是在数据中
收集表格、图表、地图或汇总摘要报告。
当以电子数据输入形式收集数据时，有时
通过设施层面使用的纸质表格的镜像，每个
表单中的输入字段可以使用这三个维度来描述。
表格本身只是一个组织数据收集的工具，
没有描述正在收集和存储的各个数据值
数据库。能够独立描述每个数据值
通过数据元素定义（例如“给予麻疹剂量\<1年”）
在处理、验证和处理时提供重要的灵活性
分析数据，并允许跨集合比较数据
表格和健康计划。

这种设计或数据模型方法将DHIS2与许多
处理数据收集的传统HIS软件应用程序
表格作为分析的关键单位。这对于量身定制的系统来说很典型
垂直计划的需求以及传统的
收集表单，也可以是报告或分析输出。的
下图说明了如何构建更细粒度的DHIS2设计
围绕数据元素的概念不同以及如何输入（数据
集合）与输出分离（数据分析），支持
更加灵活多样的数据分析和发布。数据
元素“给定\ <1 y的麻疹剂量”是儿童的一部分
免疫收集表格，但可以单独使用
称为“麻疹覆盖率\ <1y”的指标（公式）
与被称为“人口\ <1y”的数据元素结合在一起
通过另一个收集表格。计算出的指标值可以
然后在DHIS2中的各种报告工具中用于数据分析，例如
具有图表，数据透视表或地图中的地图的定制设计报告
GIS模块。

![](resources/images/implementation_guide/data_input_output.png)

## 指标驱动的数据分析和报告

上面称为数据元素的关键维度
描述正在收集的内容，有时也称为
其他设置中的指示灯。在DHIS2中，我们区分数据
描述原始数据的元素，例如收集的计数，
和指标，它们基于公式并描述计算值，
例如用于数据分析的覆盖率或发生率。
指标值的收集不像数据（元素）值，而是
而是由应用程序根据由
用户。这些公式由一个系数（例如1、100、100、100
000），分子和分母，后两者都是表达式
基于一个或多个数据元素。例如。指标“麻疹覆盖率
\ <1年”定义了一个因子为100的分子，即分子（“麻疹”
给1岁以下儿童的剂量”）和分母（“目标
1岁以下人口”）。指标“ DPT1至DPT3辍学率”为
100％x（“给定的DPT1剂量”-“给定的DPT3剂量”）/（“ DPT1
给定的剂量”）。这些公式可以通过用户添加和编辑
用户界面受过有限的培训，因为它们很容易设置
且不会干扰数据库中存储的数据值（因此
添加或修改指标不是关键操作）。

指标可能代表了最强大的数据分析功能
DHIS2和所有报告工具均支持指标的使用，例如
如上图的自定义报告中所示。能够使用
分母中的人口数据可以比较健康
目标对象不同的地理区域的效果，
这比仅查看原始数字更有用。桌子
下面使用原始数据值（剂量）和指标值（Cov）
用于不同的疫苗。比较例如在这两个第一个orgunits
列表，Taita Taveta县和Kilifi县，在DPT-1免疫接种中，我们
可以看到原始数字（659和2088）表明还有更多
剂量以Kilifi给出，覆盖率（92.2％vs 47.5％）显示
Taita Taveta在为目标免疫方面做得更好
1岁以下的人口。查看最后一栏（免疫混合百分比）
这表明了免疫形式报告的完整性
在同一时期，我们可以看到数字或多或少
我们比较的两个县都一样，这告诉我们覆盖率
可以合理地比较两个县的比率。

![](resources/images/implementation_guide/indicator_report.png)

## 维护数据库中的分类设施数据

收集数据并将其存储在DHIS2中后，它将保持分解状态
在数据库中的详细程度与所收集的相同。这个
具有HIS数据库系统的主要优点是
基于纸张甚至基于电子表格的系统。系统设计
存储大量数据，并始终允许向下钻取
可能的最佳细节水平，仅受数据方式的限制
已收集或导入到DHIS2数据库中。从一个角度
国家HIS，希望按健康状况对数据进行分类
设施级别，通常是组织单位中的最低级别
层次结构。即使不使用此级别的计算机也可以做到这一点，
通过纸张和计算机的混合系统。数据可以提交
从医疗机构到纸上的民政事务处（例如
一项特定设施的每月摘要表），然后在
他们通过以下方式将所有设施数据输入到DHIS2中
电子数据收集表，一次提供一个设施。这将
使地区卫生管理团队能够明智地执行设施
数据分析和提供反馈报告的打印输出
由DHIS2生成，包括设施比较，与设施
他们所在地区的负责人。

## 支持卫生系统中任何级别的数据分析

尽管名称DHIS2表示关注区域，但该应用程序
在健康的各个层面提供相同的工具和功能
系统。在所有报告工具中，用户可以选择哪个组织单位或
组织单位级别进行分析，显示的数据将自动
汇总到所选级别。 DHIS2使用组织单位
向上汇总数据并按任何组织单位提供数据的层次结构
在这个层次结构中。大多数报告的运行方式使得
将提示用户选择一个组织单位，从而使
所有级别的报告布局相同。或者，如果需要，报告
如果需要，可以将布局调整到卫生系统中的任何特定级别
不同级别之间的需求有所不同。

在GIS模块中，用户可以分析数据，例如地方政府
级别，然后点击地图（例如某个地区或省）
向下钻取到下一个级别，并一直这样下去直到
设施级别的数据源。类似的下钻
链接到的Excel数据透视表中提供了功能
DHIS2数据库。

提供时可加快性能并减少响应时间
汇总数据输出，其中可能包含许多计算（例如
总共8000个设施），DHIS2会预先计算所有可能的结果
汇总值并将其存储在所谓的数据集市中。这个
可以安排数据集市在给定的时间间隔内运行（重建），
例如每天晚上。
