---
edit_url: "https://github.com/dhis2/dhis2-docs/blob/master/src/commonmark/en/content/implementation/a-quick-guide-to-dhis2-implementation.md"
---

# DHIS2实施快速指南

地区卫生信息软件（DHIS2）的任何实施
应旨在建立灵活的，可持续的系统
卫生部门不断变化的需求。重要的是要承认
这将需要很多年，并具有连续的产能结构
建设，最佳实践共享和创新。本快速指南将
提供有关DHIS2不同方面的非常粗略的概述
实施。

## 规划与组织

### 需要的结构

  - DHIS核心团队（DCT）将需要4-5个人来管理
    国家HMIS。他们的责任和所需技能应
    明确规定。 DCT将参加DHIS2学院，
    为组织中的各个用户组组织培训和最终用户支持
    国家。

  - 需要一个技术指导委员会或同等的委员会来
    指导卫生计划之间的协调，其他信息
    系统和开发合作伙伴以及大学。他们将带领
    整合工作并就整体做出决策
    信息系统的体系结构。

### 整合努力

  - 在整个实施过程中，信息同步投入
    系统集成和数据交换需要进行。的
    这项工作的主要原则应该是创造一个
    决策驱动和指标导向的系统。

### 设备和互联网

  - 评估需要确定对硬件的需求。台式机
    笔记本电脑，平板电脑和手机的质量各不相同，并且
    通常需要将这些不同技术混合在一起
    支持的。

  - 服务器和托管替代方案需要严格审查
    关于能力，基础设施限制，法律框架，
    安全和机密性问题。

  - 所有用户都需要Internet连接。移动网络
    将适合大多数进行数据收集的用户，并且
    定期分析。

  - 手机用户选项，批量短信交易等应为
    检查是否适当。

### 推出策略

  - DCT将在这里扮演关键角色，每个成员都应明确
    推出范围的职责：用户支持，用户
    培训，与健康计划的联络等

  - 需要建立更广泛的支持结构以提供
    与全球/区域网络的支持，监督和沟通
    专家用户和开发人员。

  - 信息使用必须从一开始就成为重点领域，
    初始系统设计和第一轮设计中的组件
    用户培训。数据收集和数据质量只会提高
    具有信息的真实价值。地区审查会议和
    相应的信息产品应支持等效功能
    和培训。

  - 随着时间的推移，培训通常是最大的投资，并且
    需要持续不断的机会结构。计划一个
    长期培训方法，以适应持续的过程
    启用新用户和新系统功能。

  - 监督和数据质量评估应经常进行。

## 适应DHIS2

### 系统范围

  - 根据决策，系统应支持（系统范围）；
    平台的定制和适应将需要
    DHIS2聚合，跟踪器和/或事件。每个动作都需要
    特殊能力，应由DCT领导。

  - 需要评估目标用户和受益人，例如
    与他们的信息需求以及硬件和网络有关
    需要。

  - 了解HIS的较大体系结构（“ HIS”
    生态系统”）很重要；还有其他哪些系统，以及如何
    他们应该与DHIS2互动吗？考虑会有什么需求
    用于电子系统之间的互操作性。

  - 如果有DHIS2当前不支持的需求，则
    评估其他软件开发是必要的。这些
    可以通过开发自定义网络应用程序或将其输入本地解决
    组织的总体核心平台开发路线图流程
    i

### 设置DHIS2

  - 报告单位：实施不同的报告单位（服务
    网点）和层次结构（包括分组）。

  - 数据收集需求：需要哪些指标，什么数据
    变量将进行计算，以及该数据应如何
    被收集？设计数据元素，分类类别，数据
    集和收集表单。

  - 行动信息（指标，仪表板，其他输出）：什么
    各种用户将需要什么信息产品？桌子
    图表，地图，仪表板。传播和共享的例程。

  - 用户管理：创建用户角色和组，用于管理的例程
    用户，定义对功能的访问权限以及适当的共享
    内容。

  - DHIS2治理文档（按配置文件角色，如何更改元数据
    以及在什么条件下）。

### 代管

  - 托管在线系统有很多不同的选择
    关于将服务器放置在何处（例如内部服务器还是云服务器）以及
    谁来管理服务器（例如，内部还是外包）。服务器和
    托管替代方案需要就以下方面进行严格审查：
    能力，基础设施限制，法律框架，安全和
    机密性问题。这些决定可能需要在
    至少每年一次，以服务器复杂度，数据类型（例如汇总与
    病人），本地容量可能会随时间变化。

## 能力建设

### DHIS核心团队（DCT）

  - DCT将需要可持续发展的所有必要技能
    系统。这包括技术技能（适应DHIS2，服务器
    维护），系统知识（架构和设计）
    原则），组织（整合策略）和项目
    管理（组织结构化的支持和培训）。

  - DCT成员应参加区域/全球DHIS2学院
    经常（例如每年两次）以确保高质量的培训，
    与更广泛的专家社区持续沟通，并
    确保当地团队掌握最新功能，并且
    DHIS 2平台的最新版本中的增强功能。 DCT将是
    负责调整和层叠此区域培训
    课程，以覆盖国内的更多用户。

### 国家培训策略

  - DCT应该提供有关实施的培训，并且
    此后不断满足不断增长的需求，系统更新和
    人员流动。

  - 改编和开发培训材料和参考指南
    反映本地信息需求，本地系统内容是
    重要。

### 持续的培训机会

  - 随着用户体验的增长，应进行更高级的培训
    提供。为地区医务人员提供信息使用培训
    卫生计划经理对尽早招募利益相关者至关重要
    在决策中使用信息。
