---
edit_url: "https://github.com/dhis2/dhis2-docs/blob/2.33/src/commonmark/en/content/user/configure-the-gis-app.md"
revision_date: '2019-08-22'
---

# 配置地图应用 { #gis_creating } 

 <!--DHIS2-SECTION-ID:gis_creating-->

## 语境 { #gis_creating_context } 

 <!--DHIS2-SECTION-ID:gis_creating_context-->

设置地图仅意味着存储组织的坐标
您要在数据库中的地图上显示的单位。座标经常
以专有格式分发，需要将其转换为
DHIS2可以理解的格式。 ESRI shapefile是最常见的
桌面应用程序的地理空间矢量数据格式。你可能会发现
您国家/地区的shapefile [此处]（http://www.diva-gis.org/gdata）或
网络上的许多其他地理空间数据存储库。一些工作
为了在DHIS2 GIS中使用这些坐标，需要完成操作，即
将数据转换为合适的格式并确保名称
包含在地理空间数据中的名称与
他们应该匹配的组织单位。

如果转到组织单位模块并编辑其中一个单位，则您
可以看到一个名为“坐标”的文本字段。在这里您可以填写
直接协调（geojson格式），如果您只是想使用，这很有用
更新几个单位。

点/设施坐标示例：

    [29.341，-11.154]

多边形/区域坐标示例
    串：

    [[[[[29.343，-11.154]，[28.329，-11.342]，[28.481，-10.239]，[29.833，-10.412]]]]

但是，如果您要在处为所有单位添加坐标
您不想手动执行的特定级别。这是
自动GML导入起作用，以下部分说明
首选的使用方式。

> **重要**
>
> DHIS2支持的唯一坐标参考系统是EPSG：4326，
>也称为地理经度/纬度。坐标必须是
>随纬度一起存储经度（东/西位置）
>（北/南位置）。如果您的向量数据位于与CRS不同的CRS中
> EPSG 4326，您需要在导入之前先重新投影数据
>进入DHIS2。

## 导入坐标 { #gis_creating_setup } 

 <!--DHIS2-SECTION-ID:gis_creating_setup-->

第1步-简化/概括您的地理数据

地理数据文件中的边界通常也非常准确
对于基于Web的GIS的需求尤其如此。这通常不影响
在本地系统上使用GIS文件时的性能，但这是
通常需要优化基于Web的地理数据
DHIS2的GIS系统。所有地理数据都需要从以下位置下载
服务器并在浏览器中呈现，因此，如果数据过于复杂，
DHIS2 GIS的性能将受到负面影响。这个
优化过程可以描述如下：

坐标：有效的小数位数（例如
23.02937874993774）应缩短为更少的数字（例如23.03）。
尽管这样做会导致地图上出现一些错误，但鉴于
在DHIS2中生成地图的通常比例（\> 1：50,000），损失
精度不应该引起注意。通常不超过四个
小数点后必须有有效数字。，
多边形：除了缩短有效位数之外，
实际点数也应减少到最佳水平。
找到这个最佳水平可能需要一些实验。减少
点的精度以及通过的点数
泛化，将导致多边形退化。但是，之后
进行一些实验，可以得出最佳的概括水平
发现，在视觉上可接受的多边形精度，以及
GIS的性能是最佳的。

对于多边形，我们需要使边界线的详细程度降低
删除一些线点。备份您的shapefile
在你开始之前。一种可能的方法是使用
[MapShaper]（http://www.mapshaper.org/）是一种在线工具，可以
用于概括地理数据。要使用MapShaper，只需上传
您的shapefile到站点。然后，在中央底部看到一个滑块
从0％开始。通常可以将其拖动到大约80％。
在左侧菜单中，您可以选中“显示原始行”以比较
结果，您可能需要尝试使用其他简化方法。
当您对结果感到满意时，请点击右上角的“导出”
角。然后检查名为“ Shapefile-
多边形”，点击“创建”，然后等待下载按钮出现。
现在，将这两个文件下载到本地计算机并覆盖
现有的。使用新的简化版继续进行下一步
shapefile。

第2步-将shapefile转换为GML

推荐的地理格式转换工具称为
“ ogr2ogr”。对于大多数Linux发行版`sudo来说，这应该是可用的。
apt安装
gdal-bin`。对于Windows，请转到<http://fwtools.maptools.org/>并下载
安装“ FWTools”并打开FWTools命令外壳。在此期间
格式转换我们还想确保输出具有正确的
坐标投影（称为EPSG：4326，具有地理经度和
纬度）。有关地理坐标的更多详细信息，
请参考此[site]（http://www.epsg-registry.org/）。如果你有
已经将地理数据重新投影到地理
纬度/经度（EPSG：4326）系统，无需明确
定义输出坐标系，假设`ogr2ogr`可以
确定输入空间参考系。请注意，大多数shapefile
正在使用EPSG：4326系统。您可以确定空间参考
通过执行以下命令来启动系统。

    ogrinfo -al -so filename.shp

假设`ogrinfo`报告的预测为EPSG：27700，
我们可以通过执行以下命令将其转换为EPSG：4326
    命令。

    ogr2ogr -s_srs EPSG：27700 -t_srs EPSG：4326 -f GML filename.gml filename.shp

如果地理数据已经在EPSG：4326中，则只需进行转换
通过执行以下命令将shapefile转换为GML。

    ogr2ogr -f GML filename.gml filename.shp

您将在shapefile所在的文件夹中找到创建的GML文件。

第3步-准备GML文件

不幸的是，GML文件尚未准备好导入。在其中打开
强大的文本编辑器，例如Geany（Linux）或Notepad ++（Windows）。 GML是
基于XML的格式，这意味着您将识别常规XML
标签层次结构。在GML文件中，组织单位表示为
\ <gml:featureMember\>。在功能成员内部，我们通常会发现很多
属性，但是我们只是要导入它们的坐标。

为了从GML的要素成员中导入地理空间数据
输入，DHIS2必须将它们中的每个与组织单位相匹配
数据库。换句话说，要素成员元素必须包含一个
参考其相应的组织单位。参考本身
必须是三个可能的DHIS2标识符之一：**uid**，** code **或
**姓名**。选择的标识符必须作为属性提供
每个功能成员元素。进口商将寻找具有
* Uid *，* Code *或* Name *的本地名称，例如“ ogr：Name”或
“ anyPrefix：代码”。

如果您的功能成员已经包含标识符的属性，则您
希望使用（例如区域名称）可以使用搜索和替换
在文本编辑器中将这些元素重命名为DHIS2将识别的名称
（请参见下表）。这通常是适用的工作流程
使用名称作为标识符时（源shapefile甚至GML
通常会包含其定义的每个区域的名称）。

 <table>
 <caption>GML导入支持的组织单位标识符</caption>
 <thead>
 <tr class="header">
 <th>匹配优先级</th>
 <th>标识符</th>
 <th>有效拼写</th>
 <th>保证唯一的</th>
 </tr>
 </thead>
 <tbody>
 <tr class="odd">
 <td> 1 </td>
 <td> Uid </td>
 <td>uid，Uid，UID</td>
 <td>是</td>
 </tr>
 <tr class="even">
 <td> 2 </td>
 <td>代码</td>
 <td>代码，代码，代码</td>
 <td>否</td>
 </tr>
 <tr class="odd">
 <td> 3 </td>
 <td>名称</td>
<td> 名称，名称，名称</td>
 <td>否</td>
 </tr>
 </tbody>
 </table>

在重命名属性的情况下，通常会找到一个名为
类似于“ ogr：DISTRICT \ _NAME”，“ ogr：NAME \ _1”并将其重命名为
“ ogr：名称”。另一方面，如果使用* code *或* uid *标识符，
在DHIS2数据库中查找正确的值并进行
GML文件，为每个相应功能添加属性
成员可能是必要的。在任何情况下，
意识到使用的标识符必须**唯一**标识一个
组织单位（例如，如果
具有相同名称或代码的数据库，它们在以下位置无法正确匹配
任何一个）。因为* uid *是唯一保证唯一的标识符，所以它是
最可靠的选择。但是，由于名称匹配通常更容易
（假设名称已经包含在您的数据中），这是一种可行的方法
解决唯一性冲突可以匹配任何非唯一命名
组织单位使用不同的标识符（最好是uid），并且
靠他们的名字。

如上表所示，有一个匹配的优先级，即
为同一功能成员提供了两个或多个标识符，
匹配将在最高优先级的标识符上执行。另请注意
GML中可以使用的有效属性。命名空间前缀
不重要，因为仅使用本地名称。

进行GML文件准备的常见陷阱是语法-
或元素命名错误。因此，请确保所有属性
GML文件的启动和终止以正确对应的
标签。还要确保属性遵循给定的有效值之一
属性名称的拼写。识别属性应该是
看起来像\ \ <ogr:Name\> Moyamba District \ </ogr:Name\>，
\ <somePrefix:uid\> x7uuia898nJ \ </somePrefix:uid\>或
\ <CODE\> OU \ _12345 \ </CODE\>。另一个常见错误是无法确保
标识符完全匹配，尤其是在使用* name *属性时。
所有匹配均以精确值执行，这意味着“ Moyamba”
GML源文件与“ Moyamba District”中的不匹配
数据库。

简要查看标识符，并将其与
数据库中的相应值。如果它们看起来相当不错，
现在是时候在import-export模块中进行预览了。

转到服务->导入导出，选择“预览”，选择GML文件
然后点击“导入”。寻找新的/更新的组织单位。我们的
目的是向已经存在的组织单位添加坐标
在数据库中，因此我们需要尽可能多的更新和0个新更新。那些
列为新的将被创建为根单元并弄乱组织
DHIS2中的单位树。如果有任何列出为新的，请单击数字和
有问题的组织单位将显示在下面的列表中。如果有
与“”中的单位部门名称相比，有任何轻微的拼写错误
数据库-修复它们并再次进行预览。否则，请点击
列表下方的“全部放弃”按钮，然后“全部导入”按钮
在列表上方。

如果导入过程成功完成，您现在应该可以
利用DHIS2 GIS中的地理数据。如果没有，请检查日志
寻找提示并查找常见错误，例如：

\-名称在GML文件中重复。数据库中的名称列为
唯一，并且不接受两个具有相同名称的组织单位。

\-数据库中organizationalunit表中的“ shortname”列
varchar定义太小。将其增加到100。

\-GML文件中的特殊名称字符。确保将它们转换为
适当的XML等效项或转义序列。

\-输入GML格式错误，标签不匹配
