---
edit_url: "https://github.com/dhis2/dhis2-docs/blob/2.35/src/commonmark/en/content/user/set-user-account-preferences.md"
---

# 设置用户帐户首选项

 <!--DHIS2-SECTION-ID:user_account_preferences-->

在**用户设置**中，您可以更改DHIS2和
数据库的语言。数据库语言已翻译
元数据的内容，例如数据元素和指标。您可以
还选择一种显示样式，并启用或禁用短信和电子邮件
通知。如果愿意，您可以选择显示一个短名称，
例如分析模块中的“乔”，而不是您的全名。

在**用户个人资料**中，您可以将个人信息添加到您的个人资料中
例如您的电子邮件地址、手机号码、出生日期、个人资料
图片等等。当您发送消息时，接收消息的人可以看到这些
个人资料详情。您还可以提供各种直接的帐户名称
消息服务，将被系统使用。

在**帐户设置**中，您可以重置密码并设置 2-Factor
验证。设置 2-Factor 身份验证将需要您
在您的移动设备上下载 Google Authenticator 应用程序。

在**查看完整个人资料** 部分，您可以找到个人资料详情的摘要。
此部分包含一些您无法自行编辑的字段，
例如用户角色和用户组织单位。


在**关于DHIS2**部分中，您找到有关DHIS2实例的详细信息列表。
