---
edit_url: "https://github.com/dhis2/dhis2-docs/blob/2.35/src/commonmark/en/content/user/what-is-dhis2.md"
---

# 什么是DHIS2？

 <!--DHIS2-SECTION-ID:what_is_dhis2-->

阅读本章后，您将能够理解：

  - DHIS2是什么以及它在健康方面的作用是什么
    信息系统（HIS）？

  - 涉及的主要技术考虑因素是什么
    部署DHIS2，以及扩展DHIS2的选项是什么
    新模块？

  - 基于患者的数据和汇总数据有什么区别？

  - 使用Free和Free有哪些好处和挑战？
    用于HIS的开源软件（FOSS）？

## DHIS2背景

 <!--DHIS2-SECTION-ID:mod1_1-->

DHIS2是用于收集，验证，分析和表示的工具
量身定制的汇总和基于患者的统计数据（但不是
限制）进行综合健康信息管理活动。它是一个
通用工具，而不是预先配置的数据库应用程序，
开放的元数据模型和灵活的用户界面，允许用户
设计特定信息系统的内容而无需
用于编程。 DHIS2是基于网络的模块化软件包
带有免费和开源Java框架。

DHIS2是BSD许可下发布的开源软件，可以
免费获得。它可以在具有Java Runtime的任何平台上运行
已安装环境（JRE 7或更高版本）。

DHIS2由卫生信息系统计划（HISP）开发，
一个开放的，全球分布的流程，开发人员目前在
印度，越南，坦桑尼亚，爱尔兰和挪威。发展是
在奥斯陆大学的协调下，NORAD和其他机构的支持
捐助者。

DHIS2软件已在非洲，亚洲，
和拉丁美洲以及采用DHIS2作为其国家的国家
全国范围的HIS软件包括肯尼亚，坦桑尼亚，乌干达，卢旺达，加纳，
利比里亚和孟加拉国。越来越多的国家和地区
组织正在开始新的部署。

随附的文档将尝试提供一个
应用程序的全面概述。鉴于...的抽象性质
应用程序，本手册将不作为完整的分步指南
在每种情况下如何使用应用程序的指南，但是
相反，它将寻求提供有关DHIS2如何进行操作的插图和示例。
通过通用示例可以在各种情况下实现。

在新环境中实施DHIS2之前，我们强烈建议您阅读
DHIS2实施指南（与此手册分开的手册），也
可以从DHIS2主网站[http://dhis2.org/documentation/）获得。

## DHIS2的主要功能和目的

DHIS2的主要功能和目的可归纳如下：

  - 提供基于数据的全面数据管理解决方案
    仓储原理和模块化结构，可以轻松实现
    为不同需求量身定制的管理信息
    系统，支持不同级别的分析
    组织层次结构。

  - 通过用户界面进行定制和本地调整。没有
    开始在新设置中使用DHIS2所需的编程（国家/地区，
    地区，地区等）。

  - 提供可以采用标准形式的数据输入工具
    列表或表格，也可以自定义以复制纸质表格。

  - 提供各种工具进行数据验证和改进
    数据质量。

  - 提供易于使用的-一键式报告，其中包含图表和表格
    使用数据设计选择指标或汇总报告
    收集工具。允许与流行的外部报告集成
    设计工具（例如JasperReports）以添加更多自定义或高级功能
    报告。

  - 分析中的灵活，动态（即时）数据分析
    模块（即GIS，数据透视表，数据可视化工具，事件报告等）。

  - 用户特定的仪表板，可快速访问相关的
    监控和评估工具，包括指标图和链接
    系统中喜欢的报告，地图和其他关键资源。

  - 易于使用的用户界面，用于元数据管理，例如对于
    添加/编辑数据集或卫生设施。无需编程
    在新设置下设置系统。

  - 设计和修改计算指标公式的功能。

  - 用户管理模块，用于密码，安全性和细粒度
    访问控制（用户角色）。

  - 可以将消息发送给系统用户以获取反馈和通知。
    消息也可以传递到电子邮件和SMS。

  - 用户可以使用以下图表和报告共享和讨论他们的数据
    解释，使活跃的信息驱动用户成为可能
    社区。

  - 数据和元数据的导出-导入功能，支持
    离线安装的同步以及互操作性
    与其他应用程序。

  - 使用DHIS2 Web-API，可以与外部集成
    通过使用和扩展核心平台软件
    自定义应用。

  - 可以根据用户需要开发和集成其他模块，
    作为DHIS2门户用户界面的一部分或更多
    通过DHIS2进行交互的松耦合外部应用程序
    Web API。

总之，DHIS2为以下方面提供了全面的HIS解决方案：
任何地方的健康信息用户的报告和分析需求
水平。

## DHIS2在HIS中的使用：数据收集，处理，解释和分析。

HIS的更广泛背景可以通过以下方式进行全面描述：
信息周期如下图1.1所示。信息周期
以图形方式描绘了不同的组件，阶段和过程
通过收集数据，检查质量，进行处理，
分析和使用。


![The health information
cycle](resources/images/dhis2UserManual/dhis2_information_cycle.png)

DHIS2支持信息周期的不同方面，包括：

  - 收集数据。

  - 运行质量检查。

  - 多个级别的数据访问。

  - 正在报告。

  - 制作图形和地图以及其他形式的分析。

  - 启用跨时间比较（例如，前几个月），并且
    空间（例如，跨设施和区域）。

  - 查看趋势（按时间序列显示数据以查看其最小值和最大值
    级别）。

第一步，DHIS2用作数据收集，记录和
编译工具，所有数据（以数字或文本形式）都可以
进入它。数据输入可以在数据元素列表中或在
定制的用户定义表格，可以开发以模仿纸张
基于表格的形式，以简化数据输入过程。

下一步，DHIS2可用于提高数据质量。首先，在
在数据输入点，可以检查数据是否在
任何特定的最小值和最大值的可接受范围水平
数据元素。例如，这种检查可以帮助识别类型
数据输入时出现错误。此外，用户可以定义各种
验证规则，DHIS2可以通过验证运行数据
识别违规的规则。这些类型的检查有助于确保
从一开始，输入到系统中的数据就具有良好的质量，并且可以
由最熟悉它的人改进。

输入并验证数据后，DHIS2可以帮助您完成
不同类型的报告。第一种是例行报告，
可以预定义，以便所有需要例行的报告
单击按钮即可完成生成。此外，DHIS2可以帮助
通过比较例如生成分析报告
跨设施或随时间推移的指标。图形，地图，报告和
健康状况是DHIS2可以产生的输出，而这些
应该由卫生部门常规生产，分析和采取措施
经理。

## 技术背景

### DHIS2作为平台

DHIS2可以在多个层面上被视为平台。首先，
应用程序数据库在设计时要充分考虑灵活性。
数据结构，例如数据元素，组织单位，表单和
用户角色可以通过应用程序用户完全自由地定义
接口。这使得该系统可以适用于
多种语言环境和用例。我们已经看到DHIS2
支持常规数据捕获和分析的大多数主要要求
在国家实施中崭露头角。这也使DHIS2成为可能
用作物流，实验室和
金融。

其次，由于DHIS2的模块化设计，因此可以扩展为
其他软件模块或通过自定义应用。这些软件
模块/应用程序可以与DHIS2和
可以集成到DHIS2门户和菜单系统中。这是一个
强大的功能，因为它可以扩展额外的系统
需要时提供功能，通常用于特定国家/地区的要求
如前所述。

软件模块可扩展性的缺点在于
开发过程中的几个限制。开发人员创建
就DHIS2技术而言，额外功能仅限于
编程语言和软件框架，以及
DHIS2门户解决方案对模块设计施加了约束。
此外，当以下情况时，这些模块必须包含在DHIS2软件中：
该软件是在Web服务器上构建和部署的，在安装过程中不会动态
运行。

为了克服这些限制并实现更宽松的耦合
在DHIS2服务层和其他软件产品之间
基于REST的API已作为DHIS2的一部分开发。该Web API
符合REST架构风格的规则。这意味着
那：

  - Web API提供了可导航和机器可读的界面，用于
    完整的DHIS2数据模型。例如，一个人可以访问全部
    数据元素列表，然后使用提供的URL导航到
    感兴趣的特定数据元素，然后使用
    提供的指向数据集列表的URL，数据元素是
    成员。

  - （元）使用以下命令通过统一界面（URL）访问数据
    纯HTTP请求。没有花哨的运输格式或
    涉及的协议-经过严格测试的，易于理解的HTTP
    协议，它是当今Web的主要组成部分。这个
    表示第三方开发人员可以使用
    DHIS2数据模型和数据，但不知道特定于DHIS2 2的数据
    技术或DHIS2设计约束条件。

  - 所有数据，包括元数据，报告，地图和图表，称为
    REST术语中的资源，可以在大多数
    当今Web的流行表示格式，例如XML，
    JSON，PDF和PNG。这些格式在以下方面得到广泛支持
    应用程序和编程语言并提供给第三方
    开发人员提供了广泛的实施选项。

### 了解平台独立性

所有计算机都有一个操作系统（OS）来管理它，并且
程序运行它。操作系统充当中间层
在软件应用程序（例如DHIS2）和硬件（例如
作为CPU和RAM。 DHIS2在Java虚拟机上运行，并且可以
因此可以在任何支持Java的操作系统上运行。平台
独立性意味着该软件应用程序可以在任何操作系统上运行-
Windows，Linux，Macintosh等。DHIS2与平台无关，因此
可以根据实际情况在许多不同的上下文中使用
要使用的操作系统要求。

此外，DHIS2支持三个主要的数据库管理系统
系统（DBMS）。 DHIS2使用Hibernate数据库抽象框架
并与以下数据库系统兼容：PostgreSQL，MySQL
和H2。 PostgreSQL和MySQL已准备好进行高质量生产
数据库，而H2对于小型数据库是有用的内存数据库
应用程序或开发活动。

最后，也许是最重要的一点，因为DHIS2是基于浏览器的
应用程序，与系统交互的唯一真正要求是
使用网络浏览器。 DHIS2支持大多数Web浏览器，尽管当前
建议使用Google Chrome，Mozilla Firefox或Opera。

### 部署策略-在线与离线

DHIS2是启用网络的应用程序，可以通过
Internet，本地Intranet以及本地安装的系统。的
DHIS2的部署替代方案在本章中定义为i）
脱机部署ii）在线部署和iii）混合部署。的
含义和差异将在以下各节中讨论。

#### 离线部署

离线部署意味着多个独立的离线
通常在区域级别为最终用户安装实例。
该系统主要由最终用户/区域健康维护
输入数据并从运行的系统生成报告的人员
他们的本地服务器。该系统通常也将由维护
国家超级用户团队，定期访问该地区
部署。最终用户将数据在层次结构中向上移动
产生数据交换文件，通过电子邮件或电子方式发送
亲自通过邮件或个人旅行。 （请注意，简短的互联网
发送电子邮件所需的连接性不符合
定义为在线）。这种部署方式具有明显的好处
在没有适当的Internet连接时可以使用。
另一方面，这种风格也面临重大挑战，
在下一节中介绍。

  - **硬件：**运行独立系统需要高级硬件
    在要安装的服务器和可靠的电源方面，
    通常在全国各地的地区级别。这需要
    适当的采购资金和长期计划
    保养。

  - **软件平台：**本地安装意味着对
    保养。从经验来看，最大的挑战是病毒和
    其他易于感染本地安装的恶意软件
    长跑。主要原因是最终用户使用记忆棒
    用于在私有之间传输数据交换文件和文档
    计算机，其他工作站和运行
    应用。保留防病毒软件和操作系统
    在离线环境中更新补丁程序具有挑战性，
    最终用户通常会采用安全方面的不良做法。
    解决此问题的首选方法是运行专门的
    不允许使用记忆棒的应用程序的服务器，以及
    使用不易受病毒感染的基于Linux的操作系统
    感染为MS Windows。

  - **软件应用程序：**能够分发新功能
    对用户的健康信息软件的错误修复是
    对于系统的维护和改进至关重要。依靠
    最终用户执行软件升级需要大量
    培训和高水平的能力提升
    软件应用程序可能是一项技术难题。依靠
    一个国家超级用户团队对软件的维护意味着很多
    的旅行。

  - **数据库维护：**高效系统的前提是
    所有用户使用标准化的元数据集（数据
    元素，表格等）。与前面关于软件的观点一样
    升级，将对元数据集的更改分发到众多
    如果进行更新，则脱机安装需要最终用户能力
    是通过电子方式发送的，还是组织有序的超级用户团队。失败
    保持元数据集同步将导致能力丧失
    从地区和/或不一致的国家/地区移动数据
    数据库是因为输入了数据，例如在地区级别
    与国家/地区数据不兼容。

#### 在线部署

在线部署意味着该应用程序的单个实例
在连接到Internet的服务器上设置。所有用户（客户端）
使用Web通过Internet连接到在线中央服务器
浏览器。由于以下原因，这种部署方式越来越有可能
全球（移动）互联网覆盖范围的可用性也得到提高
作为现成的廉价云计算资源。这些
的发展使得即使在大多数情况下也可以访问在线服务器
使用移动互联网调制解调器的农村地区（也称为
*加密狗*）。

这种在线部署方式对
实施过程和应用程序维护相比
传统离线独立样式：

  - **硬件：**最终用户方面的硬件要求是有限的
    到相当现代的计算机/笔记本电脑和Internet连接
    通过固定电话或移动调制解调器。不需要
    每个用户的专用服务器，任何启用Internet的计算机都将
    足够。在线部署将需要服务器，
    但是由于只有一台（或几台）服务器需要
    采购和维护，这明显更简单（也更便宜）
    与维护许多单独的服务器相比，位置是完全不同的。给定
    云计算资源持续稳定减少
    价格，同时提高计算能力，建立强大的功能
    云中的服务器比采购硬件便宜得多。

  - **软件平台：**最终用户仅需要Web浏览器即可
    连接到在线服务器。当今所有流行的操作系统
    随网络浏览器一起提供，没有特殊要求
    关于什么类型或版本。这意味着如果出现严重问题，例如
    经常发生病毒感染或软件损坏的情况
    重新格式化并安装计算机操作系统，或者
    获取新的计算机/笔记本电脑。用户可以继续输入数据
    保留在原处，不会丢失任何数据。

  - **软件应用程序：**中央服务器部署样式意味着
    该应用程序可以在集中式升级和维护中
    时尚。新版本的应用程序发布时
    功能和错误修复，可以将其部署到单个在线
    服务器。然后，所有更改将反映在客户端
    下次最终用户将通过Internet连接。这显然有一个
    对于改进新系统的过程产生巨大的积极影响
    功能可以立即分发给用户，所有用户将
    访问相同的应用程序版本，可能会出现错误和问题
    整理并即时部署。

  - **数据库维护：**与上一点类似，更改为
    元数据可以在集中式在线服务器上完成
    时尚，下次会自动传播到所有客户
    他们连接到服务器。这有效地消除了广泛的问题
    与维护升级的标准化元数据集有关
    与传统的离线部署样式有关。它是
    非常方便，例如在初始数据库期间
    开发阶段以及年度数据库修订过程中
    因为最终用户将访问一致且标准化的
    数据库，即使更改频繁发生。

在Internet连接的情况下，此方法可能会出现问题
长时间波动或丢失。 DHIS2但是有
某些功能需要Internet连接才能可用
系统仅在一部分时间内正常工作，例如离线
数据输入。通常，DHIS2确实需要Internet连接
某种程度上，但这甚至越来越是一个容易解决的问题
偏远地区。

#### 混合部署

通过到目前为止的讨论，人们意识到在线部署
样式优于离线样式，但需要像样的互联网
连接将在哪里使用。请务必注意，
提到的样式可以在常见部署中共存。太完美了
在单个内进行联机和脱机部署是可行的
国家。一般规则是，地区和设施应
如果有足够的Internet，则可以通过Internet在线访问系统
存在连通性，应将离线系统部署到区域
如果不是这样的话。

精确定义良好的Internet连接非常困难，但是通常
拇指的下载速度应至少为10 KB /秒
客户端和至少1 Mbit / sec（专用）的服务器带宽。

在这方面，可以连接到
电脑或笔记本电脑以及访问移动网络的能力非常强大
可行的解决方案。移动互联网覆盖范围正在迅速增加
在世界各地，通常以低廉的价格提供出色的连接
并且是本地网络的绝佳替代品，维护不善
互联网线路。与国家移动网络联系
关于后付费订阅和潜在大订单的公司
好处可能是值得的。每个网络的覆盖范围
相关国家/地区的网络运营商应在何时进行调查
决定选择哪种部署方法，因为它可能有所不同，以及
覆盖全国不同地区。

#### 服务器托管

在线部署方法提出了在何处以及如何进行的问题。
托管将运行DHIS2应用程序的服务器。通常在那里
有几种选择：

1.  卫生部内部托管

2.  在政府数据中心内托管

3.  通过外部托管公司托管

选择第一选择的主要原因通常是政治上的
具有数据库“实际所有权”的动机。这是
为了“拥有”和控制数据，许多人认为这很重要。
也希望为服务器管理建立本地能力
与项目的可持续性有关。这通常是捐助者驱动的
被视为一项具体而有益的任务。

关于第二种选择，某些地方是政府数据中心
旨在促进和改善使用和
公共数据的可访问性。另一个原因是
内部服务器环境对资源的要求很高，而且还更多
有效地建立集中式基础设施和能力。

关于外部托管，最近有向外包的趋势
对外部计算机资源的操作和管理
提供商，通常通过网络访问这些资源
称为“云计算”或“软件即服务”。那些
通常使用Web浏览器通过Internet访问资源。

在线服务器部署的主要目标是长期提供
对预期服务的稳定和高性能访问。什么时候
决定为服务器环境选择哪个选项
要考虑的方面：

1.  服务器管理和操作的人员能力。必有
    在服务器管理方面具有一般技能的人力资源；
    在用于该应用程序的特定技术中
    服务。此类技术的示例是Web服务器和数据库
    管理平台。

2.  可靠的自动备份解决方案，包括本地服务器外
    和远程备份。

3.  稳定的连接性和高网络带宽，用于往返于
    从服务器。

4.  稳定的电源，包括备用解决方案。

5.  有关诸如以下问题的物理服务器的安全环境
    通道，盗窃和火灾。

6.  存在灾难恢复计划。该计划必须包含一个
    确保仅提供服务的现实策略
    在发生硬件故障的情况下停机时间很短，
    网络停机时间等等。

7.  可行，强大而强大的硬件。

必须涵盖所有这些方面，以创建适当的
托管环境。故意将硬件要求放在最后
因为有一种明显的趋势使其给予过多的关注。

回顾三个主要的托管选项，
发展中国家的执行任务表明，所有
在可行的方案一和方案二中很少出现托管方面的问题
水平。在所有这些方面达到可接受的水平具有挑战性
在人力资源和金钱方面，尤其是与
方案三的成本。它的好处是可以容纳
提到政治方面和建立服务器本地能力
另一方面，可以在
替代方式。

选项三-外部托管-具有支持所有功能的优势
提到的托管方面的价格非常实惠。一些
托管提供商-虚拟服务器或软件即服务-提供
用于运行大多数应用程序的可靠服务。例子
这样的提供者是[Linode]（http://www.linode.com）和[Amazon Web
服务]（http://aws.amazon.com）。管理此类服务器
通过网络连接，这通常是最常见的情况
本地服务器管理。服务器在此的物理位置
这种情况变得无关紧要，因为此类提供商在大多数情况下都提供服务
世界各地。该解决方案正日益成为标准
托管应用程序服务的解决方案。建筑方面
服务器管理的本地容量与此选项兼容
因为当地的ICT团队可以负责外部维护
托管服务器，但不必担心电源问题
电源和带宽限制通常在主要
数据中心。

一种将外部托管的好处与需求相结合的方法
对于本地托管和物理所有权是使用外部托管
主要交易系统的提供商，同时对此进行镜像
服务器到本地托管的非关键服务器，该服务器用于
只读用途，例如数据分析和通过Intranet访问。

## HIS中汇总数据和患者数据之间的差异

*患者数据*是与单个患者有关的数据，例如他/她
诊断，姓名，年龄，较早的病史等。此数据为
通常基于单个患者-医护人员的互动。对于
例如，当患者前往医疗诊所时，
可能会记录详细信息，例如患者的体温，
体重和各种血液检查。该患者应被诊断为
具有“未指定的维生素B 12缺乏性贫血”
ICD-10代码D51.9，这种特殊的交互作用最终可能会得到
在基于汇总的系统中记录为“贫血”的实例。
当您想纵向跟踪时，基于患者的数据很重要
随着时间的推移患者的进度。例如，如果我们要跟踪
病人如何坚持和应对结核病进程
治疗（通常在6-9个月内进行），我们需要
基于患者的数据。

*汇总数据*是与多个相关的数据的合并
患者，因此无法追溯到特定患者。
它们仅是计数，例如疟疾，结核病或其他疾病的发生率
疾病。通常，医疗机构处理的常规数据
是这种汇总统计信息，用于生成
例行报告和指标，最重要的是战略计划
在卫生系统内。汇总数据无法提供以下类型
患者级别数据可以提供的详细信息，但对于
规划和指导卫生系统的绩效。

在这两者之间，您有基于案例的数据，或者是匿名的“患者”
数据。可以收集有关特定健康事件的许多详细信息
不必识别涉及的患者。
住院或门诊，霍乱新病例，产妇死亡
等是常见的用例，希望收集更多
详细信息，仅添加到案件总数或访问次数中。这个
数据通常以行列表类型或其他形式收集
详细的审核表格。从某种意义上说，它与汇总数据不同
它包含有关特定事件的许多详细信息，而
汇总数据将计算某种类型的事件数，例如怎么样
许多主要诊断为“疟疾”的门诊就诊，或有多少次
死者未参加ANC的产妇死亡人数，或有多少人
5岁以下儿童霍乱暴发。在DHIS2中，此数据为
通过单事件类型的程序收集而没有
注册。

患者数据是高度机密的，因此必须受到保护，以便
除了医生，没有人能得到它。在纸上时，必须是
正确存放在安全的地方。对于计算机，患者数据需求
使用密码，受限制的访问和审核日志来保护系统安全。

对汇总数据的安全性关注并不像对患者那么重要
数据，因为通常无法识别某人
汇总统计。但是，数据仍然可能被滥用，并且
被其他人误解，不应在没有足够信息的情况下分发
数据传播政策到位。

## 自由和开源软件（FOSS）：好处和挑战

软件带有指示计算机如何操作的说明。
这些指令的人工编写和可读形式是
称为源代码。在计算机实际执行之前
指令，必须将源代码翻译成机器可读的
（二进制）格式，称为目标代码。所有分布式软件
包括目标代码，但是FOSS使源代码可用于
好。

专有软件所有者将其受版权保护的对象代码许可给
用户，允许用户运行程序。 FOSS计划
另一方面，同时许可对象和源代码，从而允许
用户运行，修改并可能重新分发程序。有访问权限
对于源代码，用户可以自由运行该程序
任何目的，重新分配，探索，适应，学习，自定义
满足他们需求的软件，并向公众发布改进版本
社区的利益。因此，一些FOSS也被称为免费
软件，其中“免费”首先是指上述自由
而不是金钱这个词。

在公共卫生部门，FOSS可能具有一系列
好处，包括：

  - 降低成本，因为它不需要支付禁止性许可证
    费用。

  - 鉴于卫生部门对信息的需求不断
    不断变化和发展，用户需要
    根据用户要求进行更改的自由。这是
    通常仅限于专有系统。

  - 访问源代码以实现集成和互操作性。在
    卫生部门不同软件之间的互操作性
    应用程序变得越来越重要，这意味着
    两个或更多系统来传递元数据和数据。这项工作是
    容易得多，有时取决于源代码
    可供创建集成的开发人员使用。这个
    在专有的情况下，通常无法获得可用性
    软件。如果是这种情况，它的成本高且合同规定
    义务。

  - 诸如DHIS2之类的FOSS应用通常受全球支持
    开发人员网络，因此可以进行前沿研究
    和发展知识。
