---
edit_url: "https://github.com/dhis2/dhis2-docs/blob/2.35/src/commonmark/en/content/user/managing-dashboards.md"
---

# 管理仪表板

 <!--DHIS2-SECTION-ID:dashboard-->

## 关于仪表盘

仪表板旨在提供对不同分析物的快速访问
对象（地图，图表，报告，表格等）分配给单个用户。
仪表板可以与用户组共享。仪表板也可以打印。

用户或管理员可以创建一个名为“产前保健”的仪表板
其中可能包含有关产前保健的所有相关信息。这个
然后可以与名为“ ANC控制”的用户组共享仪表板，
其中可能包含ANC控制程序的所有用户。全部用户
这样，该组中的用户就可以查看同一仪表板。

## 仪表板和控制栏

 <!--DHIS2-SECTION-ID:dashboards_setup-->

仪表板具有标题、描述和任意数量的仪表板项目。
仪表板项目可以是许多不同的类型，包括图表、
地图、报告、表格、资源、消息和文本项目。以上
仪表板是控制栏，显示所有可用的仪表板，
包括一个仪表板搜索字段和一个 **+** 按钮，用于创建一个
新仪表板。

仪表板有两种模式：查看和编辑/创建。首次登录时
到DHIS2，您最近使用的仪表板将显示在视图中
模式，如果您与以前使用同一台计算机。如果你是
使用其他计算机，则第一个加星标的信息中心将是
显示。如果没有加星标的信息中心，则第一个信息中心（按字母顺序）
将显示。加星标的仪表盘始终首先显示在仪表盘中
清单。

下面的屏幕截图显示了一个名为“产前保健”的信息中心，
已经填充了图表和地图。

![](resources/images/dashboard/dashboard-view-mode.png)

### 在仪表板列表中搜索

您可以使用“
标题为“搜索仪表板”的控制栏的左上方。的
搜索不区分大小写，并且在您键入时，仪表板列表将
筛选出与您的搜索文字匹配的内容。

### 自定义控制栏的高度

您可以通过以下方式为仪表板控制栏设置特定的高度：
向下单击并拖动控制栏的底部边缘。当你
完成拖动后，将设置新的高度。点击**显示更多**
会将控制栏扩展到最大高度（10“行”）。点击
在**显示较少**上会将高度重置为您自定义的高度。

## 创建仪表板

要创建新的信息中心，请点击左侧的绿色** + **按钮
控制栏的一角进入创建模式。在标题中添加标题
标题字段，以及描述字段中的描述（可选）。如果不添加标题，则仪表板将自动命名为“未命名仪表板”。

![](resources/images/dashboard/dashboard-add-new.png)

**创建模式：**

![](resources/images/dashboard/dashboard-create-mode.png)

### 将项目添加到仪表板

通过从
仪表板区域的右上部分。可用的项目包括：

- 可视化

- 地图

- 活动报告

- 活动图

- 报告

- 资源资源

- 应用

- 电子邮件

- 文字框

- 垫片

根据您输入的搜索文本，下拉列表中的项目列表最初显示10个可视化效果（图表和表格），以及其他每个类别中的5个。在下拉菜单中还可以找到电子邮件，文本框和分隔符项目。查看更多
项目，点击**显示更多**，该类型的列表将为
扩展到25个项目。如果仍然找不到所需的项目，请尝试
输入更具体的搜索文字。

![](resources/images/dashboard/dashboard-item-selector.png)

选择一个项目后，该项目将被添加到
仪表板。可以使用鼠标通过以下方式移动添加的项目
向下单击该项目并将其拖动到所需位置。它
也可以通过右键单击拖动手柄来调整鼠标的大小
在项目的右下角，然后拖动到所需的大小。

#### 垫片项目

仪表板配置有“反重力”设置，用于
定位项目。这意味着物品将“上升”直到它们
碰到另一个项目。为了迫使之间的垂直空间为空
项（如空行），您可以将间隔项添加到仪表板。
它们仅在编辑/创建模式下可见。在查看模式下，它们不是
显示，但占用定义的空间。

**编辑/创建模式**中的空格：

![](resources/images/dashboard/dashboard-spacer-edit-mode.png)

**查看模式下的垫片**：

![](resources/images/dashboard/dashboard-spacer-view-mode.png)

### 移除物品

通过单击右上角的红色垃圾桶来删除物品
项目。请注意，由于“反重力”设置
仪表板，当您删除项目时，位于下面的项目
被删除的项目将“向上”上升。

### 打印预览

单击**打印预览**按钮，以查看仪表板在仪表板布局打印中的外观。

![](resources/images/dashboard/dashboard-edit-print-preview.png)

单击**退出打印预览**以返回到编辑仪表板。

请注意，某些项目可能会向下移动以避免分页符。项目也可能会缩短以适合一页。缩短的项目在预览的右上角显示一个信息图标。该图标在实际打印中被删除。

### 保存仪表板

创建或编辑仪表盘时，仅在以下情况下保存更改：
点击位于顶部的信息中心编辑栏中的**保存更改**按钮
这一页。如果您不想保存更改，请单击右上角的**不保存退出**按钮。然后您将返回
您以前查看过的仪表板的“查看模式”。

## 编辑现有的仪表板

如果您具有编辑当前活动仪表板的访问权，则可以
将是视图中仪表板标题右侧的**编辑**按钮
模式。单击此按钮进入编辑模式。

![](resources/images/dashboard/dashboard-title-bar.png)

请参阅上述有关创建仪表板的部分，以获取有关以下信息：
在仪表板上添加和删除项目。

![](resources/images/dashboard/dashboard-edit-mode.png)

### 翻译仪表板标题和描述

您可以在以下时间添加仪表板标题和说明的翻译：
编辑模式。该对话框提供了要翻译的语言列表，以及
在名称输入字段下方显示原始仪表板标题。

![](resources/images/dashboard/dashboard-translation-dialog.png)

1.  点击位于仪表盘上方的**翻译**按钮

2.  选择您要为其添加翻译的语言。

3.  添加标题和/或描述，然后单击**保存**

## 删除仪表板

如果您有权删除仪表板，则将有一个
在编辑模式下，位于仪表盘上方的**删除**按钮。一种
首先将显示确认对话框，以确认您要
删除仪表板。

## 查看仪表板

在查看模式下，您可以切换显示说明，为仪表板加注星标，应用过滤器，打印仪表板以及与其他用户和组共享仪表板。

### 显示说明

要切换说明，请点击** ...更多**按钮，然后选择**显示说明**（或**隐藏说明**）。您打开的所有仪表板都会记住该设置。此设置适用于您，不适用于其他用户。

![](resources/images/dashboard/dashboard-title-bar.png)

### 已加星标的仪表板

已加星标的仪表板在仪表板列表中首先列出。至
为仪表板加注星标，单击标题右侧的星标按钮。您也可以从** ...更多**菜单中切换星星。
当星标被“填满”时，表示仪表板已加星标。主演
仪表板仅适用于您，不适用于其他用户。

### 筛选仪表板

可以将多个过滤器应用于仪表板以更改数据
显示在各种仪表板项目中。
过滤器以相同的方式应用于每个仪表板项目：
每个添加的过滤器都会覆盖该维度中的原始值
原始图表，表格或地图（可视化）。
可以过滤组织单位，期间和其他
动态尺寸取决于DHIS2实例。

要添加过滤器，请点击**添加过滤器**按钮，然后选择
方面：

![添加过滤器](resources/images/dashboard/dashboard-filters.png)

将打开一个对话框，您可以在其中选择过滤器。

![组织单位过滤器选择](resources/images/dashboard/dashboard-orgunit-filter-dialog.png)

点击对话框中的**确认**，将过滤器应用于
当前的仪表板。

过滤器不会存储，因此在切换到其他仪表板时
迷路了。
过滤器徽标显示在仪表板项目上方，以
指示仪表板项目中显示的不是原始内容
可视化，但过滤器优先
存储的尺寸值。

![当前过滤器显示为仪表板上方的标志]](resources/images/dashboard/dashboard-filter-badges.png)

可以单击过滤器徽章以打开过滤器选择对话框
因此可以进行滤镜编辑。
通过单击徽章中的**删除**按钮，可以删除过滤器。
每当添加，编辑或删除过滤器时，仪表板项目
重新加载以显示更新的数据。
在以下情况下，过滤器徽章始终在页面顶部可见
滚动显示板内容。

### 打印仪表板

从** ...更多**菜单中，您可以打印活动的仪表板。仪表板打印有两种样式：仪表板布局和每页一项。对于这两种样式，将添加一个标题页，以显示仪表板标题，描述（如果启用了“显示描述”设置）以及所有应用的仪表板过滤器。

![](resources/images/dashboard/dashboard-print-menu.png)

为了获得最佳打印效果：

- 使用Chrome或Edge
- 等到所有仪表板项目都已加载后再打印
- 使用具有默认边距的A4横向设置

#### 打印仪表板布局

仪表板布局打印将近似显示在浏览器中的仪表板布局。请注意，可能需要对布局进行一些调整以避免分页符：某些项目的位置可能会向下调整，而高于一页的项目则会缩短。

单击右上角的**打印**按钮以触发浏览器打印功能。

![](resources/images/dashboard/dashboard-print-layout.png)

#### 每页打印一项

这种打印样式会将每个仪表板项目打印在单独的页面上，从而最大程度地利用纸张。

单击右上角的**打印**按钮以触发浏览器打印功能。

![](resources/images/dashboard/dashboard-print-oipp.png)

## 带有图表，数据透视表和地图的仪表板项目

### 在可视化之间切换

可以切换显示图表，数据透视表和地图的仪表板项目
在这些可视化之间。单击项目右上角的项目菜单按钮，然后选择所需的视图：

![](resources/images/dashboard/dashboard-item-menu.png)

## 释义

您可以为图表，数据透视表，地图，事件编写解释
报告和事件图表项目。在仪表板项目菜单上，单击**显示解释和详细信息**：

![](resources/images/dashboard/dashboard-item-menu-interpretations.png)

该项目将在下方垂直展开以显示说明，
解释和答复。您可以喜欢一种解释，回复
解释，并添加您自己的解释。您可以编辑，共享或删除
您自己的解释和答复，并且如果您拥有版主访问权限，
您可以删除其他人的解释。

可以格式化描述字段和解释
使用Markdown样式标记\*和\ _带有**粗体**，_italic_
分别代表**粗体**和_italic_。用于编写新文本的文本字段
解释具有用于添加富文本的工具栏。键盘快捷键
也可以使用：Ctrl / Cmd + B和Ctrl / Cmd +I。
smilies受支持，可以通过键入以下命令之一来使用
字符组合：:) :-) :( :-(：+1：-1。URL是自动的
检测并转换为可点击的链接。

解释按日期降序排列，最新显示在顶部。
解释答复按日期升序排列，最旧的显示在顶部。

![](resources/images/dashboard/dashboard-interpretations.png)

## 共享仪表板

 <!--DHIS2-SECTION-ID:dashboard_sharing-->

为了与用户组共享仪表板，请单击**分享**
仪表板标题右侧的按钮以显示仪表板
共享设置选项。与特定用户共享仪表板或
用户组，在输入字段中输入名称以将其添加到
仪表板共享设置

![](resources/images/dashboard/dashboard-sharing-dialog.png)

默认情况下，所有仪表板都有两个共享组。

- 外部访问（无需登录）

  选中此选项后，您可以通过以下方式访问仪表板
  通过API的外部资源。当您创建一个
  外部门户网站，但希望从
  您在DHIS2内部创建的仪表板。默认情况下，
  未选择选项。有关更多信息，请参阅开发人员指南中的[查看分析性资源表示形式]（https://docs.dhis2.org/master/zh/developer/html/webapi_viewing_analytical_resource_representations.html#）。

- 公共访问（登录）

  此选项允许将选定的仪表板推送给所有用户
  在您的DHIS2实例中。也可以在公众视野中隐藏
  通过选择“无”选项，这是新的默认选项
  仪表板。

可以为手动添加的用户组分配两种类型的
仪表板内的权限

- 可以查看

  为用户组提供对仪表板的仅查看权限。

- 可以编辑和查看

  除了查看外，还允许用户组编辑仪表板
  它。编辑允许更改布局，调整大小和删除
  项，重命名/删除仪表板等。

您可以为用户提供仪表板的URL，使他们能够
直接导航到仪表板。要获取信息中心网址，只需
在查看模式下访问仪表板，然后复制浏览器网址。对于
例如，play.dhis2.org / demo中“产前保健”仪表板的网址
是：

https://play.dhis2.org/demo/dhis-web-dashboard/\#/nghVC4wtyzi
