---
edit_url: "https://github.com/dhis2/dhis2-docs/blob/2.34/src/user/using-reporting-functionality.md"
revision_date: "2021-06-14"
---

# 报告应用程序中的报告功能 { #using_the_reports_app }

该报告应用程序可用于罐装，标准报告，数据集报告，资源和组织单位分布报告。

## 使用标准报告 { #standard_reports_in_the_beta_reports_app }

您可以通过导航到Apps-\> Reports（Beta）访问可用的报告。在里面
在左侧栏中的“报告”菜单中，单击“标准报告”。全部清单
预定义的报告将出现在主窗口中。

![](resources/images/dhis2UserManual/react_reports_app_standard_reports.png)

您可以通过单击报告的三点图标来运行/查看报告，然后
从上下文菜单中选择“创建”。如果有任何
预定义的参数，您将看到一个报告参数窗口，您可以在其中
必须填写组织单位和/或报告月份所需的值，
取决于在基础报告表中定义的内容。
准备好后，单击“生成报告”。报告要么出现
直接在您的浏览器中或作为 PDF 文件下载，
取决于您处理 PDF 文件的浏览器设置。你可以保存
文件并将其保存在本地计算机上以备后用。

## 使用数据集报告 { #dataset_reports_in_the_beta_reports_app }

数据集报告是数据输入屏幕的打印机友好视图
填充原始数据或聚合数据。这些仅适用于
具有自定义数据输入表单且不用于默认或
节表格。

您可以从Apps-> Reports（Beta）访问数据集报告。

将出现一个标准窗口，您可以在其中填写您的详细信息
报告：

**数据集：**您要显示的数据集。

**报告期间：** 您想要数据的实际期间。这可以是
聚合期和原始期。这意味着您可以要求
季度或年度报告，即使收集了数据集
每月。数据集的周期类型（收集频率）定义在
数据集维护。首先选择期间类型（Monthly、Quarterly、
每年等）在 Prev 和 Next 按钮旁边的下拉菜单中，然后
从下面的下拉列表中选择一个可用的时间段。用
Prev 和 Next 可向后或向前跳跃一年。

**仅使用所选单位的数据：** 如果您想要一个
报告有孩子的组织单位，但只想要数据
直接为本单位收集的数据，而不是其收集的数据
孩子们。如果您想要一个组织单位的典型汇总报告，您可以
不想勾选这个选项。

**报告组织单位：** 在这里选择你想要的组织单位
的报告。这可以在层次结构中的任何级别作为数据
将自动聚合到此级别（如果您不勾选
上面的选项）。

填写完报告标准后，单击
“产生”。该报告将以 HTML 格式以打印机友好的格式显示。
使用浏览器中的打印和另存为功能进行打印或保存（如
HTML) 报告。您还可以在 Excel 中导出数据集报告和
PDF 格式。

## 使用报告率摘要 { #reporting_rate_summary_in_the_beta_reports_app }

从“应用程序”->“报告（测试版）”菜单中访问报告率摘要。
报告费率摘要将显示有多少个数据集（表格）
按组织单位和期间提交。

报告率是根据完整的数据集注册计算得出的。
完整的数据集注册是指用户将数据输入表单标记为
完成，通常通过单击数据输入屏幕中的完成按钮，
特此向系统表明她认为该表格是
完全的。这是一种主观的计算方法
完整性。

报告率摘要将为每一行显示一系列度量：

-   实际报告：表示相关数据集的数据录入完整注册数量。

-   预期报告：表示预计有多少数据输入完成注册。该数字基于相关数据集已分配到的组织单位的数量（启用数据输入）。

-   报告率：根据预期数量登记为完整的报告的百分比。

-   按时报告：与实际报告相同，仅在报告期结束后的最大天数内登记为完整的报告。可以在数据集管理中为每个数据集定义报告期后的天数。

-   按时报告率：与百分比相同，仅将按时注册为完成的报告用作分子。

要运行报告，您可以按照以下步骤操作：

-   从树中选择一个组织单位。
-   选择一个数据集。

-   选择一种期间类型，并从该期间类型的可用期间列表中选择一个期间。

-   然后将提交报告。更改上面的任何参数，然后再次单击“获取报告”查看相应的结果。

![](resources/images/dhis2UserManual/react_reports_app_reporting_rate_summary.png)

## 使用资源 { #resources_in_the_beta_reports_app }

资源工具允许您从本地上传这两个文件
计算机到 DHIS 服务器并添加到其他资源的链接
通过 URL 上网。如果您的系统配置了云存储，
资源将保存在那里。

要创建新资源：

1.  打开 **报告（测试版）** 应用程序并单击 **资源**。

2.  点击**添加新**。

3.  输入一个**名称**。

4.  选择**类型**：**上传文件**或**外部URL**。

5.  点击**保存**。 

## 使用组织单位分布报告 { #orgunit_distribution_reports_in_the_beta_reports_app }

您可以从左侧菜单访问组织单位分布报告
在“应用程序”->“报告（测试版）”中。

组织单位分布报告是显示组织单位如何
分布在各种属性上，如类型和所有权，以及
地理区域。

结果可以显示在基于表的报告或图表中。

**运行报告：**

要运行报告，首先在左上角的组织单位中选择一个组织单位
树。该报告将基于位于所选
单位。选择要使用的组织单位组集，
通常这些是类型、所有权、农村/城市，但可以是任何
用户定义的组织单位组集。您可以单击获取报告
获取基于表格的演示或获取图表以获得相同的结果
在图表中。您还可以将基于表格的报告下载为 Excel 或
CSV。

![](resources/images/dhis2UserManual/react_reports_app_org_unit_dist.png)
